<script setup>
import { ref, onUpdated } from 'vue'
import { news } from "../../data/NewsData.js"

const props = defineProps(["id"]);
const data = ref(news[props.id - 1]);

onUpdated(() => {
  data.value = news[props.id - 1];
})
</script>

<template>
  <div class="container">
    <div class="date">
      {{ data.date ? data.date : "23.03.2023" }}
    </div>
    <h1>Заголовок {{ data.header ? data.header : props.id }}</h1>
    <div v-if="data">{{ data.content }}</div>
    <div class="text">
      <p>
        Текст (от лат. textus — ткань; сплетение, сочетание) — зафиксированная
        на каком-либо материальном носителе человеческая мысль; в общем плане
        связная и полная последовательность символов.
      </p>
      <p>
        Существуют две основные трактовки понятия «текст»: имманентная
        (расширенная, философски нагруженная) и репрезентативная (более
        частная). Имманентный подход подразумевает отношение к тексту как к
        автономной реальности, нацеленность на выявление его внутренней
        структуры. Репрезентативный — рассмотрение текста как особой формы
        представления информации о внешней тексту действительности.
      </p>
      <p>
        В лингвистике термин «текст» используется в широком значении, включая и
        образцы устной речи. Восприятие текста изучается в рамках лингвистики
        текста и психолингвистики. Так, например, И. Р. Гальперин определяет
        текст следующим образом: «Это письменное сообщение, объективированное в
        виде письменного документа, состоящее из ряда высказываний, объединённых
        разными типами лексической, грамматической и логической связи, имеющее
        определённый модальный характер, прагматическую установку и
        соответственно литературно обработанное».
      </p>
    </div>
  </div>
</template>

<style scoped>
.date {
  text-indent: 20px;
}

.container {
  background-color: white;
  color: #000;
  margin-top: 20px;
}

.text {
  color: #000;
  margin-top: 10px;
  font-size: 18px;
  line-height: 1.5em;
  text-indent: 20px;
}

h1 {
  font-size: 35px;
  text-align: center;
  line-height: 1.5em;
}
</style>
