export const news = [
  {
    id: 1,
    header: "Заголовок 1",
    content: '<div class="text">      <p>        Текст (от лат. textus — ткань; сплетение, сочетание) — зафиксированная        на каком-либо материальном носителе человеческая мысль; в общем плане        связная и полная последовательность символов.      </p>      <p>        Существуют две основные трактовки понятия «текст»: имманентная        (расширенная, философски нагруженная) и репрезентативная (более        частная). Имманентный подход подразумевает отношение к тексту как к        автономной реальности, нацеленность на выявление его внутренней        структуры. Репрезентативный — рассмотрение текста как особой формы        представления информации о внешней тексту действительности.      </p>      <p>        В лингвистике термин «текст» используется в широком значении, включая и        образцы устной речи. Восприятие текста изучается в рамках лингвистики        текста и психолингвистики. Так, например, И. Р. Гальперин определяет        текст следующим образом: «Это письменное сообщение, объективированное в        виде письменного документа, состоящее из ряда высказываний, объединённых        разными типами лексической, грамматической и логической связи, имеющее        определённый модальный характер, прагматическую установку и        соответственно литературно обработанное».      </p>    </div>"',
    date: "21.01.2023",
  },
  {
    id: 2,
    header: "Заголовок 2",
    content: "Содержание новости 2",
    date: "21.01.2023",
  },
  {
    id: 3,
    header: "Заголовок 3",
    content: "Содержание новости 3",
    date: "21.01.2023",
  },
  {
    id: 4,
    header: "Заголовок 4",
    content: "Содержание новости 4",
    date: "21.01.2023",
  },
];
